[
  {
    "content": "Hey salespeople: How has the recent global economic climate impacted your deals?\nA) Major impact. Uncertainty. Budget cuts. Dead deals.\nB) Minor impact. Annoying issues here and there; nothing catastrophic.\nC) No impact.\nD) Show answers.\nP.S. FREE: Fill Your Funnel Masterclass Despite 2025 Headwinds.\nLearn from a $30M/year CRO on how to double the size of your pipeline.\nClaim free ticket here: https://lnkd.in/euMFrviZ",
    "tag": "Sales",
    "comments_count": 6,
    "likes": 4
  },
  {
    "content": "Sales leaders, don’t forget:\n\nSometimes, getting your sales team to the next level of success has nothing to do with a great sales process or better selling skills.\n\nSometimes, the next unlock is changing your pricing model, adding a new, highly sellable feature, or even changing your target customer profile.\n\nStrategy first, execution second. Do both?\n\nThat is how you build a sales organization with a reputation for sales excellence.",
    "tag": "Sales Leadership",
    "comments_count": 5,
    "likes": 50
  },
  {
    "content": "To all salespeople who want to book your calendar solid with qualified, closeable sales meetings and pipeline:\n\nWho do you want to learn prospecting from?\nA 'trainer' who's never (really) done it?\nA course bro who's never (really) done it?\nSome guy from the 80s who hasn't done it since then?\nOr the CRO of one of the hottest SaaS companies of 2025 who built his growth engine to $30 million ARR in a few years on based on his outbound methods?\n\nI know my pick.\n\nWho do you want to learn cold outreach with video prospecting from?\nSomeone who's never done it?\nOr someone who is 'known' for booking pipeline solid via cold outreach and video?\n\nNext week, me, Kyle Norton and Melissa Gaglione ⭐️  are teaching our advanced cold calling, prospecting, and pipeline generation methods in a free masterclass (with $200 million worth of deal data to back it up).\n\nThe Fill Your Funnel Masterclass, free.\n\nThe goal:\nGive you a simple, repeatable system to:\n1) Fill your funnel with ideal-fit buyers\n2) Overcome nagging, knee-jerk objections on sales calls\n3) Ask ‘context-led questions’ that get even the coldest C-Suite Buyers to open up (& make it feel like buying was “their idea”)\n4) Close more deals – fast – with less stress than you have now\n\nHere’s where to go next: https://lnkd.in/euMFrviZ",
    "tag": "Sales and Marketing",
    "comments_count": 18,
    "likes": 36
  },
  {
    "content": "Salespeople: Clear goals are like magnets. When you set them with unmistakable clarity, they attract the things that make them come true. …more",
    "tag": "Sales",
    "comments_count": 11,
    "likes": 54
  },
  {
    "content": "6 words of the best advice for salespeople who lose deals in the final hour ⬇️\n\nDon't \"Await\" the Verdict. Influence It.\n\nA few years ago I noticed a strange pattern:\n\nWhenever I was waiting on a ‘verdict’ from a buyer, I lost.\n\n“We have a budget meeting on Tuesday where my boss is going to make a decision. I’ll let you know what we decide.”\n\nSome get excited to hear things like that.\n\nI dread it.\n\nDeals like that sound good.\n\nBut they almost always go south.\n\nThis isn't just true when closing deals.\n\nI noticed the same thing when raising funding.\n\nI noticed it again when recruiting.\n\nI usually lost when candidates said things like this:\n\n“Thanks Chris. I’m making my final decision on where to work next by Friday. Can I call you then and let you know what I decide?”\n\nTrust me when I say this:\n\nIf you’re passively awaiting a verdict, bad sign.\n\nYou’re going to lose whenever this is the dynamic:\n\n“Final decision meeting is on Monday. I’ll let you know then.”\n\nNow.\n\nYou might be thinking:\n\n“Damn Chris, you’re right! I lost 8 out of 10 deals where I was ‘awaiting a verdict!’”\n\nIf that’s you, your next thought is probably:\n\n“So what do I do so I don’t lose?”\n\nFollow this rule:\n\nDon’t await the verdict. Influence it.\n\nWhenever I'm in a pipeline review with my AE team, any time I hear a situation where they’re awaiting a verdict, I ask this:\n\n“How can we move from awaiting to influencing the verdict?”\n\nTwo examples:\n\nExample 1:\n\nBuyer: “I’ve got a final budget meeting with my CFO Friday. I should have an answer then.”\n\nInstead of waiting until Friday where your weekend will promptly be ruined, say this:\n\n“As you can imagine, I’ve helped a few dozen others sell this internally to their CFO. Mind if we find 30 min before the meeting to put a 1-page business case together? I can share some angles that worked in the past.”\n\nPerfect.\n\nNow you’re not awaiting your doom.\n\nYou’re taking the bull by the horns.\n\nExample 2:\n\n“I’m reviewing all of my notes between vendors and I’ll make my final decision Tuesday.”\n\nThis one’s harder.\n\nYou had a champion in your corner in the first example.\n\nBut this? You’re dealing with a coy buyer.\n\nSay this:\n\n“I can understand that, and I have to ask: If you learned nothing new between now and Tuesday, what would you decide and why?”\n\nA tad aggressive?\n\nMaybe.\n\nBut now you’re getting something you can work with.\n\nInstead of saying “Ok… Talk Tuesday…!” you instead have a chance to influence their thinking.\n\nSee the difference?\n\nIf you’re awaiting a verdict, you are an ‘effect.'\n\nIf you’re influencing a verdict, you are a 'cause.'\n\nYou’re making things happen instead of letting things happen.\n\nBig difference.\n\nAs I reflect on the last decade selling SaaS, recruiting, and raising capital, I’ve found this to be true:\n\nYou will lose 8/10 deals where you’re awaiting a verdict.\n…more",
    "tag": "Sales Training",
    "comments_count": 45,
    "likes": 351
  },
  {
    "content": "Salespeople: How often do you get \"discovery fatigue\" from your buyers - where they get impatient with your questions and want you to \"get on with the show?\"\nP.S. Here's a free 14 minute training to eliminate discovery fatigue and get powerful responses to your discovery questions: https://lnkd.in/efsy2_Yb",
    "tag": "Sales Training",
    "comments_count": 13,
    "likes": 30
  },
  {
    "content": "Last week, we closed two $160,000 deals at pclub.io. Each one needed C-SUITE approval. Here's what separated us from the pack of other sellers:\n\nAsking DIFFERENT questions to the C-SUITE as we do mid level buyers.\n\nIf you ask the same questions to the C-SUITE as you do a mid level manager? They will EMBARRASS you.\n\nThey’ll roll their eyes as you lose them.\n\nOr they’ll tell you to\" get on with it\" while you lose control.\n\nInstead:\n\nQuestions that win over C-SUITE executives have 4 elements.\n\n1. They lead with a relevant observation.\n\n“So what are the biggest challenges in your org?”\n\nThere’s no insight here.\n\nIt doesn’t make them think.\n\nYou should have already asked this to their subordinates. Great C-SUITE questions start with insight.\n\n“It looks like you stepped into the COO role three 3 months ago and your top initiative is to consolidate your go-to-market team under one umbrella. \"You have 5 products with 5 specialized sales orgs. You plan to de-silo them and have all sellers represent all 5 products, turning your AEs into generalists.”\n\n“What typically comes with that change is sellers have to learn a variety of new skills they didn’t need before like multi-threading, selling effectively to new personas, and more complex discovery. \"To what extent are you anticipating that?”\n\nThat.\n\nTHAT is the kind of question that commands attention.\n\n2. The question is perceptive and thoughtful.\n\nGo read the example again.\n\nThe observation doesn’t end with a generic:\n\n“So what do you think is going to be hard about this?”\n\nThat’s not bad. But we can do better.\n\nInstead, it ends with a question that forces them to anticipate a problem.\n\n3. The question is problem-focused.\n\nNot product-focused.\n\nNot YOU-focused.\n\nAsk a question that FEELS agnostic to your product.\n\nThe question should put the spotlight on your buyer and their world.\n\nNot on “how you can help.”\n\nThey're not ready for that conversation yet.\n\n4. The question makes them THINK or RESPOND emotionally.\n\nYou’re looking for two responses:\n\nA) A lightbulb moment.\n\nYou asked a question that made them think to themselves:\n\n“Damn, I haven’t thought of that yet but there’s something here.”\n\nB) Emotionally respond\n\nIf your question doesn’t make them think, it should at least trigger an enthusiastic response.\n\nOne where your buyer feels like you REALLY “get it.”\n\nYou can sense whether you’ve hit the mark.\n\nYour buyer’s voice changes.\n\nThey sit up.\n\nThey lean in.\n\nYou’re struck a chord.\n\nOk.\n\nGo watch the video to get a word for word example.\n\nPlus, a breakdown of the question.\n\nWhen you master asking thought-provoking questions?\n\nBigger deals.\n\nBigger commission checks.\n\nBigger W2s.\n\nYou know, the things that got you into sales in the first place.\n\nGo get it.\n\nOh. And if you want a master list of 39 questions that sell?\n\nI’ve got that for you free.\n\nI put this together for personal use.\n\nDecided to give it away.\n\nGrab your free list of 39 questions that sell here: https://go.pclub.io/list\n…more",
    "tag": "Sales Strategy",
    "comments_count": 22,
    "likes": 142
  },
  {
    "content": "Salespeople who sell a true AI product - what are your biggest sales challenges unique to selling AI?\n\nExamples might include:\n-Qualfiying and finding serious buyers rather than people who are intellectually curious about AI.\n- Overcoming fear when it comes to AI.\n- Selling the vision of transformation rather than solely resolving existing pain.\n- Finding budget where none exists for AI projects.",
    "tag": "Sales",
    "comments_count": 39,
    "likes": 70
  },
  {
    "content": "Today’s socks. Happy St. Patrick’s Day.",
    "tag": "St. Patrick's Day",
    "comments_count": 13,
    "likes": 111
  },
  {
    "content": "The biggest thing I see salespeople \"miss\" about discovery?\n\nThey don't know the difference between:\n\n- a business problem\n- a root cause of the business problem\n\nThese are different things, and understanding that has a huge impact on how you sell.\n\nWhen I ask sellers, \"what do you think are the benefits of identifying the root cause of the buyer's problem?\"\n\nI get answers like this:\n\n- creates more urgency\n- develops the pain\n- quantifies value\n\nWrong.\n\nIdentifying the root causes of the problem doesn't:\n\n- create demand\n- accelerate demand\n- amplify demand\n\nHere's what it DOES do:\n\nIt CHANNELS demand onto YOUR solution (if you do it right).\n\nWhy?\n\nBecause your product's features and specs don't solve business problems wholesale.\n\nEach feature aligns to a root cause of the business problem.\n\nSo, when you identify (and influence) the perceived root causes?\n\nThey are more likely to buy YOUR product rather than someone elses.\n\nBut make no mistake:\n\nIdentifying the root cause doesn't build pain.\n\nIt just helps your buyer conclude:\n\n\"It seems like the best way to solve my pain is to buy this particular product.\"",
    "tag": "Sales Training",
    "comments_count": 13,
    "likes": 142
  },
  {
    "content": "8 (painful) differences between the best and worst SaaS Sellers ⤵⤵\n\n1. Pricing.\nThe best salespeople can quote you $350,000 with a straight face. Totally casual. Zero hangups. Calm, cool, collected.\nThe worst salespeople tremble and shake when they talk big money. They’re uncomfortable talking about price and it shows.\n\n2. Discovery.\nThe best salespeople uncover the ‘need behind the need.’ They don’t stop with surface level need. They go deep, but in a conversational way.\nThe worst salespeople show their product at the slightest hint of a need they can solve. Discovery be damned.\n\n3. Prospecting.\nThe best salespeople know that’s it’s too early to sell the benefits of their product. So they do something different. They agitate the problem. They articulate the buyer’s pain better than the buyer can.\nThe worst salespeople focus their outreach on the product. It’s benefits. How it works. It’s features. The ROI.\n\n4. Discounts.\nThe worst salespeople lob huge discounts “if you sign this month.” Even if the buyer is nowhere near a decision.\nIt’s not that the best salespeople never use discounts. But they only give ‘qualified discounts.’ The ask why the buyer is asking for it. They qualify whether the buyer has the authority to act on it. Only then do they consider it.\n\n5. Next Steps.\nThe worst salespeople “pencil in” a meaningless calendar invite as a next step. Or worse, they schedule nothing and follow up via email.\nThe best salespeople know what the next step should be, who should be involved, and why. Plus, they see around corners. They are thinking about the next THREE steps. Not just the next one.\n\n6. Demos.\nThe worst salespeople show you ever feature. The more they show, the more value they build, they think.\nThe best salespeople “solve exactly.” They show you exactly what pieces of their product solve your problem. They leave out everything else. \n\n7. Negotiation.\nThe worst salespeople don’t negotiate. They haggle. The only tool they have in their negotiation kit is to give something away and ask for something in return.\nThe best salespeople treat negotiation as problem solving. They ask about the buyer’s underlying need behind the concession request. They find creative ways to address it.\n\n8. Skill Acquisition.\nThe worst salespeople think sales is a born trait. You have it or you don’t.\nThe best salespeople know that “sales” is just a collection of skills. Each one can be learned, practiced, reinforced, and mastered. So they build their skills accordingly.\n\nThese are 8 key differences.\n\nThe good news?\nYou can move from “worst” to “best” with new skills.\nYou’re not YEARS away from anything you want.\nYou’re SKILLS away from anything you want.\nNew skills are how you collapse a decade into a year.\n\nP.S. Collapse a decade of income growth into a year by mastering virtually every aspect of SaaS sales with a FREE trial of pclub.io here: https://lnkd.in/gzF2YwKt",
    "tag": "Sales Training",
    "comments_count": 22,
    "likes": 233
  },
  {
    "content": "20 sales cheat codes I wish I knew when I started my first AE job:\n\n1. Buyers spend more to relieve pain than to achieve gain. Stop obsessing about benefits. Start obsessing about problems.\n\n2. The biggest opportunity your competition is probably not leveraging is deep multi-threading.\n\n3. The demo your product team teaches you never works. They mean well, but they are too interested in making customers aware of every feature. Only show the features that solve problems. Leave off the rest.\n\n4. One of the best sales hacks is responding fast. Responding fast to inbound leaders. Responding fast to emails. Buyers mirror your speed.\n\n5. Personalization will help you book more outbound meetings. But there are diminishing returns. Adding too much personalization creates a lot of work and doesn't add to conversion.\n\n6. Offering an 'end of month' discount only ever works if your buyer has control over pulling the trigger. If they have to get approval from others, go through legal, procurement, etc. it's not going to work.\n\n8. Spend more time getting new influencers up to speed on past conversations you've had with their colleagues. \n\n9. A great question will always have more influence power than a great statement.\n\n10. People don't buy because of ROI. ROI doesn't create demand. It justifies demand. Position your ROI accordingly.\n\n11. Your perfect sales technique will not close the deal if you're talking to the wrong person. I still remember the best discovery call I've ever run. I didn't close the deal. Wrong person.\n\n12. Social selling isn't better than cold email. Cold email isn't better than cold calling. These channels work together. Leverage them as 'land, sea, and air.' Stop thinking binary.\n\n13. If you can describe your buyer's problem better than they can describe it, their lightbulbs will turn on. It's a beautiful thing. Buyers favor the seller that can best articulate their problems.\n\n14. Get to know your market like the back of your hand. If you know your buyers so well that you can peer into their soul, you'll rarely lose.\n\n15. Buyers never reveal the real problem after the 1st or 2nd question. Uncovering the 'need behind the need' is the closest thing to a magic bullet in sales.\n\n16. Executives want to know you've done your homework. If you show up to a sales call with a C-SUITE exec and ask a generic question, you'll lose them forever.\n\n17. Never negotiate price until it's the last open issue. If agreeing on price doesn't close the deal, it's too early to negotiate.\n\n18. Every time you demo a feature, preface it with the problem it solves. You'll double your demo effectiveness with this change alone.\n\n19. Stop blaming buyers for falling short. If they said they were going to sign last month, and they didn't, that's your fault. Not theirs.\n\n20. The best product demos are more about the customer than they are about product.\n\nP.S. Master every aspect of SaaS sales with a FREE trial of pclub.io here: https://lnkd.in/gzF2YwKt",
    "tag": "Sales Tips",
    "comments_count": 51,
    "likes": 511
  },
  {
    "content": "Unsolicited financial advice to salespeople:\n\nIf you work for a company that's CRUSHING it through hypergrowth, and you're making a ton of money:\n\nDon't go buy a home at the upper end of your affordability limit.\n\nWhy?\n\nBecause hypergrowth companies OVERPAY during the hypergrowth phase.\n\nAnd salespeople often believe this will last forever.\n\nMany times, hypergrowth companies are not worried about efficiency. Just growth.\n\nBut then, when they reach a critical mass as a company:\n\nThey focus on efficiency far more.\n\nThey focus on profitability far more.\n\nAnd, they become less dependent on having ultra talented people on the frontlines, since they're so big they can't really be stopped.\n\nYou know what all that means?\n\nBigger quotas.\n\nChanged comp plans.\n\nI've seen some sellers go from earning the 'land of milk and honey,' buying their dream home, only for the music to stop in a couple years and they're slammed financially.\n\nClose your deals. Make as much money as humanly possible. But... try to sock away a lot of it. Your future self will thank you.\n\nFreedom > stuff.\n\nP.S. Add $50k-$100k in additional annual income by mastering every skill, topic, and selling scenario that exists with a pclub.io membership: https://lnkd.in/g5fsZNDk",
    "tag": "Financial Advice",
    "comments_count": 13,
    "likes": 75
  },
  {
    "content": "Ok. Who's the bigger idiot:\nHotels for never providing utensils in your room?\nOr me for forgetting that's the case for the 6000th time, ordering Doordash anyway, and figuring out how the hell I'm going to eat it?",
    "tag": "Sales",
    "comments_count": 0,
    "likes": 118
  },
  {
    "content": "One of the hard realities for salespeople who become very successful: Many of your colleagues will shit-talk you behind your back to each other.They’ll call you lucky. They’ll say management favors you. They say you get the best leads.Trust me.It’s just part of the journey. Keep doing your thing. Let ‘em hate. Fail without complaint. Succeed without apology.",
    "tag": "Sales",
    "comments_count": 52,
    "likes": 278
  },
  {
    "content": "9 embarrassing sales mistakes I wish I knew when I started:\n\n1. Pitching benefits in cold emails. The best cold emails are surprising devoid of the product. Even its benefits. Instead they agitate pain. They look like a page out of your buyer's private journal. Pain now. Product later.\n\n2. Showing features that don't map to pain. If a feature doesn't align with a pain your customer shared, leave it out of the demo. Make every feature 'audition' for the demo. Bench the ones that don't map to pain. You're not building value by oversharing. You're destroying it.\n\n3. Spending too much time with the wrong buyer. The single best sales call I ever ran? I still didn't close the deal. Why? There's no sales technique on the planet that can save you if you're talking to a \"low propensity\" buyer. Who > What and How in sales.\n\n4. 'Letting up' on the gas when I had a big pipeline. We all have a tendency to slow down with prospecting when your pipeline is big. This is the cause of income rollercoasters. A big pipeline can turn small 'very' quickly with deals closing, falling out, or going south. If you haven't been prospecting? You're in for a lean season.\n\n5. Drinking too much. Sales is a performance job. Plain and simple. If you drink too many nights a week, you're nothing compared to your potential. It took all of my twenties to realize this. \n\n6. Filling a need as soon as I found one. Almost every AE does this. You jump on a call. You ask a few questions. The customer shares a need you can fill. And BAM!!!! \"We can help with that!\" If this is you, know that you only understand 10% of the problem. That is a disservice to them, and your W2. \n\n7. Generic discovery with executives. I read all the classic books. SPIN Selling. Solution Selling. All of it. I assumed it all applied when you landed the meeting with the C-SUITE. Not the case. When you arrive in a C-SUITE meeting, your questions should be piercingly specific. None of this \"So what are your biggest challenges?\" I once had a COO leave the room after I asked a handful of questions like that. Was he a jerk? Sure. Did I suck? You bet.\n\n8. Confusing influencers with champions. There's nothing you can do to create urgency more than creating a champion. One that's willing to run through walls to get a deal done. Most companies have a potential champion somewhere in the building. It's your job to find them, and activate them. \n\n9. Negotiating price in a vacuum. If you're negotiating, and your counterpart is not up to speed on the business problem, good luck. They aren't there to create mutual value. They are there to exact price discounts. Review the business value first. Negotiate second.\n\nWhat mistakes did you make early on?\n\nP.S. Make 2025 your best income and W2 year ever. Master every aspect of SaaS and B2B sales and learn from the top 1% of revenue experts with a pclub.io membership: [https://lnkd.in/g5fsZNDk](https://lnkd.in/g5fsZNDk)\n…more",
    "tag": "Sales",
    "comments_count": 38,
    "likes": 176
  },
  {
    "content": "three worst questions to ask during discovery calls:\n\n- questions you could have looked up online\n- how does this impact you personally?\n- what keeps you up at night?\n\nThat's what 90% of salespeople ask.\n\nWant to join the top 10% of income earners?\n\nTry these 6 questions that make discovery calls, sell:\n\n1. Tell me about your biggest challenges in X-area that you'd regret not solving six months from now?\n\nEasy enough.\nJust enough to kickstart discovery.\nAnd get to the 'heart of the matter' fast.\n\nThis question is a filter.\nCustomers don't answer with 'nice to solves.'\nThey filter out the noise.\nInstead they share priorites.\n\n2. What's going on in the business that's driving [what they shared] to be a priority.\n\nHere's what happens when you ask this:\nCustomers will CHUCKLE half the time.\n\nWhy?\nBecause you are striking a chord.\nThey're thinking about what's going on behind the scenes.\nThey're thinking about the train wreck.\nThey're thinking about the meetings they've had about it.\nYou're uncovering the 'need behind the need.'\nThat's where money lives.\n\n3. What metric is struggling most from that?\n\nHere's where most sellers struggle:\nQuantifying pain.\n\nWhen you can quantify pain (vs. just find pain)?\nYou walk into a new world.\nUrgency ramps up.\nSpending money begins to look REAL good.\n\n4. What are the second-order effects this challenge is having on the business?\n\nLanguage matters.\n\nThis question is the same as:\n\"How is this impacting you?\"\n\nBut the phrasing isn't salesy.\nIt signals business acumen.\nWeak language gets weak answers.\nPowerful language gets powerful answers.\n\n5. Who else is impacted by this, and how?\n\nThis does two things:\na) helps you plant the seeds to multi-thread\nb) increases the scope of the problem\n\nWhen your buyer:\n- talks about other influencers\n- explains how they're impacted\n\nIt's much easier to multi-thread.\n\n6. What's driving you to solve all this now rather than later?\n\nAsk this too early?\nThey'll roll their eyes.\n\nBut:\nIf you ask this AFTER those first questions?\nYour customer now has the full picture.\nNow their answers here will be richer.\n\nThat's all for now.\n\nTag a seller who'd like these questions.",
    "tag": "Sales Training",
    "comments_count": 39,
    "likes": 494
  },
  {
    "content": "Career enterprise sellers: Why did you choose to forego leadership and instead be an individual contributor?\nI think this choice needs to be celebrated more often.",
    "tag": "Career Development",
    "comments_count": 0,
    "likes": 98
  },
  {
    "content": "In 3 hours, we're kicking off the 1st annual Skill Stacker Awards contest!\nDozens of prizes at stack, including a FREE $10,000 trip to Fiji for two.\nThink of this like a global President's Club contest.\nB2B sellers from around the world will be competing for awards like:\n- top 10% seller\n- top 25% seller\n- Rookie of the year\n- Mentor of the year\n- Biggest transformation\n- Founder-led seller of the year\nWe're kickoff off the contest with a live event happening at 9am (pacific) TODAY.\nJoin and enter the contest here: https://lnkd.in/g3ZPbmXN",
    "tag": "Sales Training",
    "comments_count": 9,
    "likes": 31
  },
  {
    "content": "Attention AEs, SDRs, Sales Managers, and Founders: We're giving away a free trip to Fiji for two ($10,000 value) as a Global President's Club Award.\n\nHere's how to win it:\n\nIntroducing the first ever Skill Stacker Awards by pclub.io\n\nIt's like the Oscar's or Emmy's for B2B sales pros.\n\nThink of it like a public-facing President's Club.\n\nWe'll be giving away prizes and rewards (along with lifetime hall of fame recognition on our website) for awards like:\n\n- Top 10% performer in your company\n- Top 25% performer in your company\n- Founder-led Seller of the Year\n- Biggest Transformation Story\n- Mentor of the Year\n- Rookie of the Year\n\nOn Feb 13, we're going to host a live event explaining how to participate, the qualification criteria, and how to win.\n\nOne fortunate contestant will win a trip for two to Fiji.\n\nAirfare and hotel covered.\n\nExcited?\n\nRegister for the contest kickoff here: https://lnkd.in/g3ZPbmXN\n\nP.S. This contest, just like a real President's Club, will last all of 2025. Register for the contest kickoff event here: https://lnkd.in/g3ZPbmXN",
    "tag": "Sales Training",
    "comments_count": 4,
    "likes": 46
  },
  {
    "content": "If you close $50k+ deals, I have news: Sales is not a numbers game. Sales is a skills game. 7 skills that grow your income without burning out on the volume game:\n\n1. Finding 'the need behind the need.'\nGreat salespeople dig under the surface. When buyers share their problems, they listen. But then they follow up with: \"What's going on in your business that's driving that to be a priority?\" THAT gets to the true priority.\n\n2. Quantifying customer pain.\nNo measurement, no money. Quantifying pain does three things: a) justifies the spend b) creates urgency c) helps your customer appreciate the magnitude of the problem. Try asking: \"What metric is suffering as a result of these challenges?\"\n\n3. Creating champions.\nA great champion runs through brick walls to get the deal done. They sell your product internally when you're not in the room. Indeed: Salespeople don't close deals. Champions do. A league of champions is like a magnetic force for closing deals.\n\n4. Business acumen.\nThe best sellers in the world are actually businesspeople that happen to know how to sell. Don't just improve your SALES acumen. Improve your BUSINESS acumen. Senior execs will respect you 10x more than reps who only know the latest sales techniques.\n\n5. Executive conversations\nYou can close five-figure deals without this skill. But if you want to close six, seven, and eight figure deals? You better have gravitas when it comes to 'facing off' with senior execs. They're direct. They use plain language. They're efficient.\n\n6. Negotiation.\nNegotiation is a 'threshold' skill. That means it makes almost all of your other skills more valuable. Becoming a great negotiator will pay dividends the rest of your life. Dig in and master it.\n\n7. Writing.\nClear writing indicates clear thinking. Sloppy writing indicates sloppy thinking. Your job as a seller is to persuade and communicate. Become a master of every medium that involves: - sales calls - written word - group presentations\n\nWhat skills would you add?",
    "tag": "Sales Strategy",
    "comments_count": 46,
    "likes": 510
  },
  {
    "content": "According to Gong, 53% of \"commit\" deals don't close by quarter-end. Here's a call I had with a tough prospect that shows exactly why (and what to do instead to close deals on time): \"We won't move forward without this,\" he started.\n\nHim: \"I want to see a full rollout plan, including professional services, for the first year before we're comfortable moving forward.\"\n\n**most reps would instantly agree to this, only to be disappointed that it doesn't close the deal**\n\nMe: \"Let's assume we did that and you were comfortable with the plan. What would still have to happen before you moved forward with us?\"\n\nHim: \"A customer reference. I'd want to talk to a happy customer of yours to see how the rollout went. This is a big deal for us so I want to eliminate risk wherever I can.\"\n\nMe: \"Ok. Assume we gave you a rollout plan you were happy with, plus 1-2 customer references. Then what happens next before you move forward?\"\n\nHim: \"We'd still have to get final sign-off from the CRO. She's aware of the proposal, but we need to get her comfortable with the details and business case.\"\n\nMe: \"Makes sense. Based on that, here's what I suggest:\"\n\n\"In the spirit of partnership, we are happy to make those investments in you in the form of creating a rollout plan and arranging a customer reference.\"\n\n\"As long as you meet us halfway and that investment is reciprocated.\"\n\n\"It feels like we still have plenty of work to do with your CRO after those are done.\"\n\n\"So let me know if it feels fair to you that we flip the order in which we tackle these upside down:\"\n\n\"I'd hate to jointly do all this work only for your CRO to shoot everything down at the end.\n\nSo let's get her on board first... then tackle the rollout plan and customer references.\"\n\nFair?\"\n\nHe agreed and we baked it into a mutual success plan.\n\nEventually, that deal closed. On time, and as planned.\n\nTAKEAWAYS:\n\n1. Had I agreed to his first ask without further qualification, I would have gotten it done, thinking the deal was in the bag, only to find out I'm not even halfway there.\n\n2. It's NOT your customer's job to create the right 'order of operations' in your mutual success plan. It's YOURS.\n\n3. When customers have big 'ASKS' in the sales cycle, don't agree to them until you know what still has to happen AFTER you've completed it.\n\nOtherwise, you're chasing your tail.\n\nTry asking this:\n\n\"Let's assume we do all that -- what would still have to happen before you and your company will be ready to move forward?\"\n\nGet ALL the asks on the table first.\n\nTHEN decide what you will (or won't) agree to.\n\nGive some.\n\nGet some.\n\nCreate a mutual plan.\n\nThose were MY three takeaways. What are yours?\n\nP.S. Master your closing motion by taking The Final Stretch (course) in your pclub subscription: https://lnkd.in/g5fsZNDk",
    "tag": "Sales Strategy",
    "comments_count": 40,
    "likes": 602
  },
  {
    "content": "15 sales books to read in 2025 to grow your income and W2:\n1. Mega Deal Secrets by Jamal Reimer\n2. Selling With by Nate Nasralla\n3. It Happened On the Sales Floor by Kevin Gaither\n4. Gap Selling \n5. Let's Get Real Or Let's Not Play\n6. The Challenger Sale\n7. The Challenger Customer\n8. SPIN Selling\n9. Solution Selling\n10. Conversations That Win the Complex Sale\n11. No BS Sales Success In the New Economy\n12. What Great Salespeople Do\n13. Where Have All the [Salespeople] Gone?\n14. Start With No\n15. Underground SaaS Sales Scripts\n\nWhat are the latest and greatest sales books you'd add to this list?\n\nP.S. Order your copy of the Underground SaaS Sales Scripts for (almost) free: https://lnkd.in/gZcrmSWE",
    "tag": "Sales Training",
    "comments_count": 78,
    "likes": 241
  }
]