[
  {
    "content": "Hey salespeople: How has the recent global economic climate impacted your deals?\nA) Major impact. Uncertainty. Budget cuts. Dead deals.\nB) Minor impact. Annoying issues here and there; nothing catastrophic.\nC) No impact.\nD) Show answers.\nP.S. FREE: Fill Your Funnel Masterclass Despite 2025 Headwinds.\nLearn from a $30M/year CRO on how to double the size of your pipeline.\nClaim free ticket here: https://lnkd.in/euMFrviZ",
    "likes": 4,
    "comments": 6,
    "tag": "Sales"
  },
  {
    "content": "Sales leaders, don’t forget:\n\nSometimes, getting your sales team to the next level of success has nothing to do with a great sales process or better selling skills.\n\nSometimes, the next unlock is changing your pricing model, adding a new, highly sellable feature, or even changing your target customer profile.\n\nStrategy first, execution second. \n\nDo both?\n\nThat is how you build a sales organization with a reputation for sales excellence.",
    "likes": 50,
    "comments": 5,
    "tag": "Sales"
  },
  {
    "content": "To all salespeople who want to book your calendar solid with qualified, closeable sales meetings and pipeline:\n\nWho do you want to learn prospecting from?\n\nA 'trainer' who's never (really) done it?\n\nA course bro who's never (really) done it?\n\nSome guy from the 80s who hasn't done it since then?\n\nOr the CRO of one of the hottest SaaS companies of 2025 who built his growth engine to $30 million ARR in a few years on based on his outbound methods?\n\nI know my pick.\n\nWho do you want to learn cold outreach with video prospecting from?\n\nSomeone who's never done it?\n\nOr someone who is 'known' for booking pipeline solid via cold outreach and video?\n\nNext week, me, Kyle Norton and Melissa Gaglione ⭐️  are teaching our advanced cold calling, prospecting, and pipeline generation methods in a free masterclass (with $200 million worth of deal data to back it up).\n\nThe Fill Your Funnel Masterclass, free.\n\nThe goal:\n\nGive you a simple, repeatable system to:\n\n1) Fill your funnel with ideal-fit buyers\n2) Overcome nagging, knee-jerk objections on sales calls\n3) Ask ‘context-led questions’ that get even the coldest C-Suite Buyers to open up (& make it feel like buying was “their idea”)\n4) Close more deals – fast – with less stress than you have now\n\nHere’s where to go next: https://lnkd.in/euMFrviZ",
    "likes": 36,
    "comments": 18,
    "tag": "Sales"
  },
  {
    "content": "Salespeople: Clear goals are like magnets.\n\nWhen you set them with unmistakable clarity, they attract the things that make them come true.",
    "likes": 54,
    "comments": 11,
    "tag": "Sales"
  },
  {
    "content": "6 words of the best advice for salespeople who lose deals in the final hour ⬇️\n\nDon't \"Await\" the Verdict. Influence It.\n\nA few years ago I noticed a strange pattern:\n\nWhenever I was waiting on a ‘verdict’ from a buyer, I lost.\n\n“We have a budget meeting on Tuesday where my boss is going to make a decision. I’ll let you know what we decide.”\n\nSome get excited to hear things like that.\n\nI dread it.\n\nDeals like that sound good.\n\nBut they almost always go south.\n\nThis isn't just true when closing deals.\n\nI noticed the same thing when raising funding.\n\nI noticed it again when recruiting.\n\nI usually lost when candidates said things like this:\n\n“Thanks Chris. I’m making my final decision on where to work next by Friday. Can I call you then and let you know what I decide?”\n\nTrust me when I say this:\n\nIf you’re passively awaiting a verdict, bad sign.\n\nYou’re going to lose whenever this is the dynamic:\n\n“Final decision meeting is on Monday. I’ll let you know then.”\n\nNow.\n\nYou might be thinking:\n\n“Damn Chris, you’re right! I lost 8 out of 10 deals where I was ‘awaiting a verdict!’”\n\nIf that’s you, your next thought is probably:\n\n“So what do I do so I don’t lose?”\n\nFollow this rule:\n\nDon’t await the verdict. Influence it.\n\nWhenever I'm in a pipeline review with my AE team, any time I hear a situation where they’re awaiting a verdict, I ask this:\n\n“How can we move from awaiting to influencing the verdict?”\n\nTwo examples:\n\n\nExample 1:\n\nBuyer: “I’ve got a final budget meeting with my CFO Friday. I should have an answer then.”\n\nInstead of waiting until Friday where your weekend will promptly be ruined, say this:\n\n“As you can imagine, I’ve helped a few dozen others sell this internally to their CFO. Mind if we find 30 min before the meeting to put a 1-page business case together? I can share some angles that worked in the past.”\n\nPerfect.\n\nNow you’re not awaiting your doom.\n\nYou’re taking the bull by the horns.\n\n\nExample 2:\n\n“I’m reviewing all of my notes between vendors and I’ll make my final decision Tuesday.”\n\nThis one’s harder.\n\nYou had a champion in your corner in the first example.\n\nBut this? \n\nYou’re dealing with a coy buyer.\n\nSay this:\n\n“I can understand that, and I have to ask: If you learned nothing new between now and Tuesday, what would you decide and why?”\n\nA tad aggressive?\n\nMaybe.\n\nBut now you’re getting something you can work with.\n\nInstead of saying “Ok… Talk Tuesday…!” you instead have a chance to influence their thinking.\n\nSee the difference?\n\nIf you’re awaiting a verdict, you are an ‘effect.'\n\nIf you’re influencing a verdict, you are a 'cause.'\n\nYou’re making things happen instead of letting things happen.\n\nBig difference.\n\nAs I reflect on the last decade selling SaaS, recruiting, and raising capital, I’ve found this to be true:\n\nYou will lose 8/10 deals where you’re awaiting a verdict.",
    "likes": 351,
    "comments": 45,
    "tag": "Sales"
  }
]